[
"倚楼听戏，临池赏尽浮灯月华，惊鸿刹那，见你秋波恍如倾世桃花。",
"山之高，月出小，月之小，何皎皎，我有所思在远道，一日不见兮，我心悄悄。",
"醉过才知酒浓，爱过才知情重。你不能做我的诗，正如我不能做你的梦。",
"最幸福不过是，你曾温柔呼唤，而我恰好有过应答。",
"不知道这漫天的雨是谁碎了的心，只是在这多雨的季节诗意般落下。",
"不是蝴蝶飞不过沧海，而是彼岸已经没有了期待。",
"你不能做我的诗，正如我不能做你的梦。",
"多少红颜悴，多少相思碎，唯留血染墨香哭乱冢。",
"白花花的一片银色，好像倾泻在山上的秋阳一般。",
"大多时间都在匆忙追赶，其实仅差一个转身回眸而已。",
"不经意的遇见，辗转了千年，咫尺天涯间，散落了一地的荒诞。",
"像孩子一样真诚，像夕阳一样唯美，像天空一样宁静。",
"最后我也丢了诗和梦想，放弃了残存的骄傲，独自一人流浪远方。",
"秋寒至才知风雨有力能蚀骨，故人散方悟相思千行无笔书。",
"喜欢一个人的感觉，就像五六月的梅雨，总带着一些唯美一点毒，却又自愿深陷其中。",
"曾许黄泉碧落，死生契阔，而今人影婆娑，爱恨蹉跎。",
"那年未见尘世繁华，未负半生牵挂，而今岁月飒沓，人已天涯。",
"前尘如故地唯美白雪，芳时明月，空悲切，终离别。",
"谁的眼如初清浅，谁的眸如初安然，谁的过往成了谁的思念。",
"你轻言无关风月的轻描淡写，一如旧欢搁浅惊艳的满地残雪。",
"曾经朝思暮念的少年，如今错落成了谁的姻缘，曾经清明通透的凡心一点，如今荒芜了谁的人烟。",
"我要像果仁一样洁净，在你的心中安睡。我要汇入你的湖泊，在水底静静地长成大树。",
"或轻、或淡、或深、或浅，在心的流离之处，存放安然。",
"我一直在等一个你，希望那天，不早不晚，风景刚好。",
"伊人一笑便倾城，使吾见之醉半生，为再次观伊人笑，烽火台上戏众生。",
"年轻的我们 ，容易把感动当成爱情， 也容易把过客当成挚爱。",
"别忧郁，你的前面是阳光，你的背后还有我，如果你看不到阳光了，就回头来看我。",
"文字有时候会散发出淡淡的幽香，又有的时候会散发出淡淡的忧伤。",
"可否把此生的遗憾化作为来世的羁绊，以后纵使黄泉路上忘川河畔也可心安。",
"我喜欢初春的树、盛夏的风、深秋的雨、冬至的雪和每天的你。",
"花开半夏，如诗如画，蒲公英开，随风天涯，生如夏花，一梦繁华，花前月下，绽放年华。",
"琴声转起，离魂夜，雨中舞，花落满地，为你舞最后倾国倾城。",
"这一世，我从雨中走来，涤尽俗世尘埃；这一次，我将前尘放开，绽放于漫天湖海。",
"烟雨江南，一世繁华，待我倾尽天下，只为陪你踏碎那一场盛世烟花。",
"夕阳又下小楼，我日日如此消磨时光，心境如水烟迷离，寂寞为空山落花。",
"在每一个清晨，记得早起，努力追逐第一缕阳光，选一种姿态，让自己活得无可替代。",
"静水流深，沧笙踏歌。三生阴晴圆缺，一朝悲欢离合。",
"有缘相遇，无缘相聚，天涯海角，但愿相忆。有幸相知，无幸相守，苍海明月，天长地久。",
"你说霞染天光，陌上花开与谁享；后来烟笼柳暗，湖心水动影无双。",
"人道海水深，不抵相思半。海水尚有涯，相思渺无畔。",
"愿你我在落雪之时相见，久久未言，脱口一句好久不见甚是思念。",
"最美的感觉是，当我在人群中回首望向你的时候，你也站在那里看着我。",
"我一生最奢侈的事，就是途中与你相遇，然后相濡以沫，共闻花香。",
"人生如逆旅，我亦是行人，但愿初相遇，不负有心人。",
"一念成悦，处处繁华处处锦。一念成执，寸寸相思寸寸灰。",
"有些风景，只能够喜欢，却不能收藏，有些人，只适合遇见，却不适合久伴。",
"人生只似风前絮，欢也零星，悲也零星，都作连江点点萍。",
"世上何物最易催少年老，半是心中积霜半是人影杳。",
"邂逅一首好词，如同在春之暮野，邂逅一个人，眼波流转，微笑蔓延，黯然心动。",
"人是懂得回忆的动物，寂寞是因为失去。只是，很多事，当时只道是寻常。",
"看时间万物却寻不到你的影子，想放弃却无法将你忘记。",
"被彻底颠覆的生活如一道未尽的路横亘在前，世界之大，我却不知其折或远。",
"车窗外一闪而逝的绿色快得拉成了一条项链，轻轻为我戴上。",
"那些花朵一样摇曳的过去，像时光一样没有办法库存。",
"孤独的执伞人在雨中只有手中的伞，而我淋雨人即便孤独却有万千雨滴与我作伴。",
"把醉了的明天寄托在潘多拉的琴弦、浮沉余生虚伪地歌咏天上人间。",
"谁的寂寞，覆我华裳。谁的华裳，覆我肩膀。",
"我在漫天风雪的回忆里披荆斩棘、你却在哪一个的字典里演绎皈依。",
"一身覆雪，雪洗风尘。凝视旷野，雪落无言，心灵沉静如冬。",
"一瞬的永恒，只是浮华里的一个瑰梦，如烟花。",
"生活就是这样，你越是想要得到的东西，往往要到你不再追逐的时候才姗姗来迟。",
"假如每次想起你我都会得到一朵鲜花，那么我将永远在花丛中徜徉。",
"从马尾到卷发，从衬衫到长裙，从帆布到高跟，从素颜到淡妆，从青涩到成熟，青春也就这么长。",
"对花对酒，落梅成愁，十里长亭水悠悠。",
"桃花笑尽春风，再难觅，何处相守，何来相聚。",
"孤意如月寂如莲，孤月独映人不眠，灯深月浅两相念。",
"我独自站在云水之涯，眺望我求不得的你啊，掌间盛开了冻伤的优钵罗花。",
"纤指红尘，醉影笑惊鸿，皓月长歌把酒临风，倾杯畅饮，尽长虹。",
"挥袖抚琴，七弦玲珑，芦苇客舟，雨朦胧。",
"前生乌衣巷，月潮空城荡，素面望，北城墙，桂树已蔓火光。",
"荏苒岁月覆盖的过往，白驹过隙，匆匆的铸成一抹哀伤。",
"相思弦，尘缘浅，红尘一梦弹指间。轮回换，宿命牵，回眸看旧缘。",
"孤意如月寂如莲，孤月独映人不眠，灯深月浅两相念。",
"万里江山尘飞扬，叹日久思望乡。故人老，青丝，染成霜。念离别，离别伤。",
"情不知所起，一往而情深，怎奈何，如花美眷，终不敌，似水流年。",
"我是人间惆怅客，知君何事泪纵横，断肠声里忆平生。",
"梦湿空阶，频敲云子惊残漏。一杯浊酒，难看红尘透。",
"万种思量，多方开解，只凭寂寞厌厌地。系我生命心，负你千行泪。",
"在那个寒冷的季节，所有的人都躲避风雨，只有你陪我一齐歌唱。",
"来是偶然的，走是必然的。因此你务必，随缘不变，不变随缘。",
"深夜听着旋律哭泣，我怕寂寞的黑。用音乐陪伴自我。",
"时刻是面斑驳的墙，却框不住心在回忆里轮回。",
"新欢旧爱，在新欢面前说忘记了旧爱，在旧爱面前说厌倦了新欢。",
"丢失在雨里，迷失向风中，忘记的就象昨日的流水，在海里那头，夕阳陪你度过。",
"闭上眼，飞花铺天盖地地涌过来，像是谁的回忆，突然从天而降。",
"总在不经意的年生。回首彼岸，纵然发现光景绵长。",
"月光的森然，乐律的精魂，一切只是幻影，稍纵即逝。",
"滴水穿石，不因其力量，而因其坚韧不拔锲而不舍。",
"我是就应和星星一齐数着你的心事，还是就应和你一齐数着天上的星星。",
"是是非非的凡尘，梦一般碎落，风一样无痕。",
"你连叹息都能够美得像是在微笑，这样要我怎样画出悲伤的你。",
"不知觉的在玻璃窗上呵出你的名字，原来你一向在我心里。",
"季节总是要经过一场无奈的离别之后，才会让那份友情深入骨髓。",
"连宇宙也在谎言中甘愿化作浮尘。连信仰也甘愿化作一地尘埃。",
"今生的重唱，只能改为独唱，所有的合奏，终将也成为清音。",
"一曲一歌，一醉一醒，一梦生命，也许，人生就是如此而已。",
"生活其实也很简单，喜欢的就争取，得到的就珍惜，失去了就忘记。",
"人生，过路客不说唏嘘。人间，你和我但是寄居。",
"青春和时光都会凋零，只有住在心里的那一朵花能够永远地灿烂下去。",
"生活是种律动，须有光有影，有左有右，有晴有雨，味道就含在这变而不猛的曲折里。",
"有些记忆，注定无法抹去；就像有些人，注定无法替代一样。",
"单调而沉闷的空气窒息着我幼小的心灵，缠绕着我飞翔的翅膀。",
"童年的那一个个追逐嬉笑的日子，有如行云流水般在我的性命的旅途中流淌。",
"遥远的距离使我相思成灰，阴阳的间隔使我欲哭无泪。",
"总有一些句子，会滴墨成伤；总有一个人，会在记忆里站成永恒。",
"自我是蓝色的，音乐是悠扬的，情绪是透明的，灵魂是飞舞的。",
"或许，转身是为了忘却，但是，转过身，却发觉，有一种撕心裂肺叫做思念。",
"细数门前落叶，倾听窗外雨声，涉水而过的声音此次响起，你被雨淋湿的心，是否依旧。",
"人生，有时轻似风，淡如水，有时浓如油，烈如酒。",
"大把大把的时光从指缝间遛走，留下许多叫知识和情感的东西握在手里。",
"思念不重，像一整个秋天的落叶。",
"美人鱼的童话让我坚信感情，也让我明白并非每段完美的感情都有一个幸福的结局。",
"感情犹如泡泡糖，甜甜的味道，却不是谁都能够吹起来品尝它的美妙。",
"淋过雨的空气，疲倦了的悲哀，我记忆里的童话已经慢慢的融化。",
"记忆像是倒在手心里的水，不论是摊平还是握紧，终究还是会从指缝中一滴一滴流淌干净。",
"愿我来世，得菩提时，身如琉璃，内外明澈，净无瑕秽。",
"我想化作一阵春风，被生活热爱，被岁月歌颂，被你留在身边。",
"世上有很多美好的事物等着你，所以你要内心温柔，安静努力。",
"岁月冗长我才明白并不是所有的念念不忘都能听到回响。",
"我还是很喜欢你，就像风走了八百里，不问归期。"
]
