const $ = require('../index')

let aTag = ['age']
let a = [
  [3, 2, 1, 0, 1],
  [2, 0, 0, 0, 0],
  [3, 2, 0, 0, 1],
  [2, 1, 1, 0, 0],
  [0, 0, 0, 0, 1],
  [2, 1, 1, 1, 0],
  [3, 1, 0, 1, 0],
  [4, 1, 1, 0, 1],
  [3, 2, 0, 1, 0],
  [4, 2, 0, 1, 1],
  [3, 2, 1, 0, 1],
  [4, 2, 1, 0, 1],
  [1, 0, 1, 0, 0],
  [3, 2, 0, 0, 1],
  [3, 0, 0, 0, 1],
  [0, 0, 0, 1, 1],
  [2, 1, 1, 1, 0],
  [4, 0, 1, 1, 1],
  [4, 1, 0, 0, 1],
  [3, 0, 1, 1, 0]
]
aTag = ['浮出水面可生存', '是否有脚蹼', '鱼类']
a = [
  ['是', '是', '是'],
  ['是', '是', '是'],
  ['是', '否', '否'],
  ['否', '是', '否'],
  ['否', '是', '否']
]
aTag = ['房产', '婚史', '年收入（万元）']
a = [
  ['是', '单身', '20', 'yes'],
  ['否', '单身', '40', 'yes'],
  ['否', '离异', '50', 'yes'],
  ['是', '单身', '50', 'yes'],
  ['是', '单身', '40', 'yes'],
  ['否', '单身', '10', 'no'],
  ['否', '离异', '20', 'no'],
  ['是', '离异', '10', 'no']
]

aTag = ['天气', '温度', '湿度', '风速']
a = [
  ['晴', '冷', '正常', '弱', 'yes'],
  ['晴', '适中', '正常', '强', 'yes'],
  ['晴', '热', '高', '弱', 'no'],
  ['晴', '热', '高', '强', 'no'],
  ['晴', '适中', '高', '弱', 'no'],
  ['阴', '热', '高', '弱', 'yes'],
  ['阴', '冷', '正常', '强', 'yes'],
  ['阴', '适中', '高', '强', 'yes'],
  ['阴', '热', '正常', '弱', 'yes'],
  ['雨', '适中', '高', '弱', 'yes'],
  ['雨', '冷', '正常', '弱', 'yes'],
  ['雨', '适中', '正常', '弱', 'yes'],
  ['雨', '冷', '正常', '强', 'no'],
  ['雨', '适中', '高', '强', 'no']
]
aTag = ['age', 'incom', 'student', 'credit_rating']
a = [
  ['youth', 'h', 'n', 'f', 'no'],
  ['youth', 'h', 'n', 'e', 'no'],
  ['middle_aged', 'h', 'n', 'f', 'yes'],
  ['senior', 'm', 'n', 'f', 'yes'],
  ['senior', 'l', 'y', 'f', 'yes'],
  ['senior', 'l', 'y', 'e', 'no'],
  ['middle_aged', 'l', 'y', 'e', 'yes'],
  ['youth', 'm', 'n', 'f', 'no'],
  ['youth', 'l', 'y', 'f', 'yes'],
  ['senior', 'm', 'y', 'f', 'yes'],
  ['youth', 'm', 'y', 'e', 'yes'],
  ['middle_aged', 'm', 'n', 'e', 'yes'],
  ['middle_aged', 'h', 'y', 'f', 'yes'],
  ['senior', 'm', 'n', 'e', 'no']
]

aTag = ['性别', '是否干部', '成绩', '论文', '是否就业'] // 是干部 是男生，不是干部 论文好
a = [
  ['男', 'y', '70-79', '优', '已'],
  ['女', 'y', '80-89', '中', '已'],
  ['男', 'n', '60-69', '不及格', '未'],
  ['男', 'y', '60-69', '良', '已'],
  ['男', 'y', '70-79', '中', '已'],
  ['男', 'n', '70-79', '良', '未'],
  ['女', 'y', '60-69', '良', '已'],
  ['男', 'y', '60-69', '良', '已'],
  ['女', 'y', '70-79', '中', '未'],
  ['男', 'n', '60-69', '及格', '已'],
  ['男', 'y', '80-89', '及格', '已'],
  ['男', 'y', '70-79', '良', '已'],
  ['男', 'n', '70-79', '及格', '未'],
  ['男', 'n', '60-69', '及格', '已'],
  ['男', 'y', '70-79', '良', '已'],
  ['男', 'n', '70-79', '良', '未'],
  ['男', 'n', '80-89', '良', '未'],
  ['女', 'y', '70-79', '良', '已'],
  ['男', 'n', '70-79', '不及格', '未'],
  ['男', 'n', '70-79', '良', '未'],
  ['女', 'y', '60-69', '优', '已'],
  ['男', 'y', '60-69', '良', '已']
]
aTag = ['白', '富', '美', '去不去']
a = [
  ['是', '是', '是', '去'],
  ['是', '是', '否', '去'],
  ['是', '否', '是', '犹豫'],
  ['是', '否', '否', '犹豫'],
  ['否', '是', '是', '去'],
  ['否', '是', '否', '去'],
  ['否', '否', '是', '犹豫'],
  ['否', '否', '否', '不去']
]
const data = [
  ['色泽', '根蒂', '敲声', '纹理', '脐部', '触感', '好坏'],
  ['青绿', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', '好瓜'],
  ['乌黑', '蜷缩', '沉闷', '清晰', '凹陷', '硬滑', '好瓜'],
  ['乌黑', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', '好瓜'],
  ['青绿', '蜷缩', '沉闷', '清晰', '凹陷', '硬滑', '好瓜'],
  ['浅白', '蜷缩', '浊响', '清晰', '凹陷', '硬滑', '好瓜'],
  ['青绿', '稍蜷', '浊响', '清晰', '稍凹', '软粘', '好瓜'],
  ['乌黑', '稍蜷', '浊响', '稍糊', '稍凹', '软粘', '好瓜'],
  ['乌黑', '稍蜷', '浊响', '清晰', '稍凹', '硬滑', '好瓜'],
  ['乌黑', '稍蜷', '沉闷', '稍糊', '稍凹', '硬滑', '坏瓜'],
  ['青绿', '硬挺', '清脆', '清晰', '平坦', '软粘', '坏瓜'],
  ['浅白', '硬挺', '清脆', '模糊', '平坦', '硬滑', '坏瓜'],
  ['浅白', '蜷缩', '浊响', '模糊', '平坦', '软粘', '坏瓜'],
  ['青绿', '稍蜷', '浊响', '稍糊', '凹陷', '硬滑', '坏瓜'],
  ['浅白', '稍蜷', '沉闷', '稍糊', '凹陷', '硬滑', '坏瓜'],
  ['乌黑', '稍蜷', '浊响', '清晰', '稍凹', '软粘', '坏瓜'],
  ['浅白', '蜷缩', '浊响', '模糊', '平坦', '硬滑', '坏瓜'],
  ['青绿', '蜷缩', '沉闷', '稍糊', '稍凹', '硬滑', '坏瓜']
]
const tree1 = new $.ml.DecisionTree(data.slice(1), data[0])
tree1.printTree()
